---
kind: method
id: M:Autodesk.Revit.DB.ElementIntersectsFilter.IsElementSupported(Autodesk.Revit.DB.Element)
source: html/d1143ae9-9086-020a-6d8e-cf4f99a8196f.htm
---
# Autodesk.Revit.DB.ElementIntersectsFilter.IsElementSupported Method

Identifies if the input element is supported by element intersection filters.

## Syntax (C#)
```csharp
public static bool IsElementSupported(
	Element element
)
```

## Parameters
- **element** (`Autodesk.Revit.DB.Element`) - The element.

## Returns
True if the element is supported, false otherwise.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null